app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def show
    @video = Video.find(params[:id])
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1

  def create
    #make_upload = Video.upload_video(params[:video])
    uploaded_io = params[:video][:video]
    name_format_video = "#{Time.now.to_i}_" << uploaded_io.original_filename
---
INSERT INTO `videos` (`address`, `coordinates`, `created_at`, `date`, `title`, `updated_at`, `user_id`, `video`) VALUES ('add', '1,2', '2012-03-19 17:06:27', '2012-03-19 17:06:00', 'Titulo', '2012-03-19 17:06:27', 1, 'video.avi')

  def destroy
    @video = Video.find(params[:id])
    @video.destroy
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 17 LIMIT 1
DELETE FROM `videos` WHERE `videos`.`id` = 17